import unittest
import uuid

import gspread
from oauth2client.service_account import ServiceAccountCredentials

from database import db_session
from manage import State, Day
from rabbit import Rabbit


class MockConfig(object):

    def __init__(self):
        self.myanmar_num = {
            0: '၀',
            1: '၁',
            2: '၂',
            3: '၃',
            4: '၄',
            5: '၅',
            6: '၆',
            7: '၇',
            8: '၈',
            9: '၉'
        }
        self.sheet_region_dict = {'YANGON Region': "ရန်ကုန်တိုင်း",
                                  'NAY PYI DAW Region': "နေပြည်တော် (ပျဉ်းမနား)",
                                  'MANDALAY Region': "မန္တလေးတိုင်း",
                                  'KAYIN Region': "ကရင်ပြည်နယ်",
                                  'MON Region': "မွန်ပြည်နယ်",
                                  'KAYAR Region': "ကယားပြည်နယ်",
                                  'KACHIN Region': "ကချင်ပြည်နယ်",
                                  'SHAN Region': "ရှမ်းပြည်နယ်",
                                  'RAKHINE Region': "ရခိုင်ပြည်နယ်",
                                  'TANIN THARYE Region': "တင်္နသာရီတိုင်း",
                                  'MA GWAY Region': "မကွေးတိုင်း",
                                  'SAGAING Region': "စစ်ကိုင်းတိုင်း",
                                  'IRRWADY Region': "ဧရာဝတီတိုင်း",
                                  'BAGO Region': "ပဲခူးတိုင်း"

                                  }

    def getStateName(self, x):
        return self.sheet_region_dict[x]

    def get_mm_num(self, num):
        mm_digit = ""

        for c in range(len(str(num))):
            mm_digit += self.myanmar_num[int(str(num)[c])]
        return mm_digit

    def daily_dua(self, x):
        return {
            1: dict(dua_mm="", dua_en="",
                    dua_ar="اَللّـهُمَّ اجْعَلْ صِيامي فيهِ صِيامَ الصّائِمينَ، وَقِيامي فيهِ قيامَ الْقائِمينَ، وَنَبِّهْني فيهِ عَنْ نَوْمَةِ الْغافِلينَ، وَهَبْ لى جُرْمي فيهِ يا اِلـهَ الْعالَمينَ، وَاعْفُ عَنّي يا عافِياً عَنْ الْمجْرِمينَ ."),
            2: dict(dua_mm="", dua_en="",
                    dua_ar="اَللّـهُمَّ قَرِّبْني فيهِ اِلى مَرْضاتِكَ، وَجَنِّبْني فيهِ مِنْ سَخَطِكَ وَنَقِماتِكَ، وَوَفِّقْني فيهِ لِقِرآءَةِ آياتك بِرَحْمَتِكَ يا اَرْحَمَ الرّاحِمينَ"),
            3: dict(dua_mm="", dua_en="",
                    dua_ar="اَللّـهُمَّ ارْزُقْني فيهِ الذِّهْنَ وَالتَّنْبيهَ ، وَباعِدْني فيهِ مِنَ السَّفاهَةِ وَالَّتمْويهِ ، وَاجْعَلْ لى نَصيباً مِنْ كُلِّ خَيْر تُنْزِلُ فيهِ، بِجُودِكَ يا أجود الاْجْوَدينَ"),
            4: dict(dua_mm="", dua_en="",
                    dua_ar="اَللّـهُمَّ قَوِّني فيهِ عَلى إقامة أمرك، وأذقني فيهِ حَلاوَةَ ذِكْرِكَ، وَاَوْزعْني فيهِ لاِداءِ شُكْرِكَ بِكَرَمِكَ، وَاحْفَظْني فيهِ بِحِفْظِكَ وَسَتْرِكَ، يا أبصر النّاظِرينَ"),
            5: dict(dua_mm="", dua_en="",
                    dua_ar="اَللّـهُمَّ اجْعَلْني فيهِ مِنْ الْمُسْتَغْفِرينَ، وَاجْعَلْني فيهِ مِنْ عِبادِكَ الصّالِحينَ اْلقانِتينَ ، وَاجْعَلني فيهِ مِنْ اَوْلِيائِكَ الْمُقَرَّبينَ، بِرَأْفَتِكَ يا اَرْحَمَ الرّاحِمينَ"),
            6: {
                "dua_mm": "",
                "dua_en": "",
                "dua_ar": "اللّـهُمَّ لا تَخْذُلْني فيهِ لِتَعَرُّضِ مَعْصِيَتِكَ، وَلا تَضْرِبْني بِسِياطِ نَقِمَتِكَ، وَزَحْزِحْني فيهِ مِنْ مُوجِباتِ سَخَطِكَ ، بِمَنِّكَ وأياديك يا مُنْتَهى رَغْبَةِ الرّاغِبي"
            },
            7: {
                "dua_mm": "",
                "dua_en": "",
                "dua_ar": "اَللّـهُمَّ اَعِنّي فِيهِ عَلى صِيامِهِ وَقِيامِهِ، وَجَنِّبْني فيهِ مِنْ هَفَواتِهِ وَآثامِهِ، وَارْزُقْني فيهِ ذِكْرَكَ بِدَوامِهِ، بِتَوْفيقِكَ يا هادِيَ الْمُضِلّي"
            },
            8: {
                "dua_mm": "",
                "dua_en": "",
                "dua_ar": "اَللّـهُمَّ ارْزُقْني فيهِ رَحْمَةَ الأيتام، وإطعام اَلطَّعامِ، وإفشاء السَّلامِ، وَصُحْبَةَ الْكِرامِ، بِطَولِكَ يا ملجأ الآملين"
            },
            9: {
                "dua_mm": "",
                "dua_en": "",
                "dua_ar": "اللّـهُمَّ اجْعَلْ لي فيهِ نَصيباً مِنْ رَحْمَتِكَ الْواسِعَةِ، وَاهْدِني فيهِ لِبَراهينِكَ السّاطِعَةِ، وَخُذْ بِناصِيَتي اِلى مَرْضاتِكَ الْجامِعَةِ، بِمَحَبَّتِكَ يا أمل الْمُشْتاقي"
            },
            10: {
                "dua_mm": "",
                "dua_en": "",
                "dua_ar": " اَللّـهُمَّ اجْعَلْني فيهِ مِنَ الْمُتَوَكِّلينَ عَلَيْكَ، وَاجْعَلْني فيهِ مِنَ الْفائِزينَ لَدَيْكَ، وَاجْعَلْني فيهِ مِنَ الْمُقَرَّبينَ اِلَيْكَ، بإحسانك يا غايَةَ الطّالِبي"
            },
            11: {
                "dua_mm": "",
                "dua_en": "",
                "dua_ar": " اَللّـهُمَّ حَبِّبْ اِلَيَّ فيهِ الإحسان، وَكَرِّهْ اِلَيَّ فيهِ الْفُسُوقَ وَالْعِصْيانَ، وَحَرِّمْ عَلَيَّ فيهِ السَّخَطَ وَالنّيرانَ بِعَوْنِكَ يا غِياثَ الْمُسْتَغيثي"
            },
            12: {
                "dua_mm": "",
                "dua_en": "",
                "dua_ar": "اَللّـهُمَّ زَيِّنّي فيهِ بِالسِّتْرِ وَالْعَفافِ، وَاسْتُرْني فيهِ بِلِباسِ الْقُنُوعِ وَالْكَفافِ، وَاحْمِلْني فيهِ عَلَى الْعَدْلِ والإنصاف، وَآمِنّي فيهِ مِنْ كُلِّ ما أخاف، بِعِصْمَتِكَ يا عِصْمَةَ الْخائِفي"
            },
            13: {
                "dua_mm": "",
                "dua_en": "",
                "dua_ar": "اَللّـهُمَّ طَهِّرْني فيهِ مِنَ الدَّنَسِ والأقذار، وَصَبِّرْني فيهِ عَلى كائِناتِ الأقدار، وَوَفِّقْني فيهِ لِلتُّقى وَصُحْبَةِ الأبرار، بِعَوْنِكَ يا قُرَّةَ عَيْنِ الْمَساكينَ"
            },
            14: {
                "dua_mm": "",
                "dua_en": "",
                "dua_ar": "اَللّـهُمَّ لا تُؤاخِذْني فيهِ بِالْعَثَراتِ، وَاَقِلْني فيهِ مِنَ الْخَطايا وَالْهَفَواتِ ، وَلا تَجْعَلْني فيهِ غَرَضاً لِلْبَلايا والآفات، بِعِزَّتِكَ يا عِزَّ الْمُسْلِمي"
            },
            15: {
                "dua_mm": "",
                "dua_en": "",
                "dua_ar": "اَللّـهُمَّ ارْزُقْني فيهِ طاعَةَ الْخاشِعينَ، وَاشْرَحْ فيهِ صَدْري بإنابة الْمخْبِتينَ، بأمانك يا أمان الْخائِفينَ"
            },
            16: {
                "dua_mm": "",
                "dua_en": "",
                "dua_ar": "اَللّـهُمَّ وَفِّقْني فيهِ لِمُوافَقَةِ الأبرار، وَجَنِّبْني فيهِ مُرافَقَةَ الأشرار، وَآوِني فيهِ بِرَحْمَتِكَ اِلى دارِ الْقَـرارِ، بإلهيّتك يا اِلـهَ الْعالَمي"
            },
            17: {
                "dua_mm": "",
                "dua_en": "",
                "dua_ar": "اَللّـهُمَّ اهْدِني فيهِ لِصالِحِ الإعمال، وَاقْضِ لي فيهِ الْحَوائِجَ والآمال، يا مَنْ لا يَحْتاجُ اِلَى التَّفْسيرِ وَالسُّؤالِ، يا عالِماً بِما في صُدُورِ الْعالَمينَ، صَلِّ عَلى مُحَمَّد وَآلِهِ الطّاهِرينَ"
            },
            18: {
                "dua_mm": "",
                "dua_en": "",
                "dua_ar": "اَللّـهُمَّ نَبِّهْني فيهِ لِبَرَكاتِ أسحاره، وَنَوِّرْ فيهِ قَلْبي بِضياءِ أنواره، وَخُذْ بِكُلِّ أعضائي اِلَى إتباع آثارِهِ، بِنُورِكَ يا مُنَوِّرَ قُلُوبِ الْعارِفي"
            },
            19: {
                "dua_mm": "",
                "dua_en": "",
                "dua_ar": " اَللّـهُمَّ افْتَحْ لي فيهِ أبواب الْجِنانِ، وأغلق عَنّي فيهِ أبواب النّيرانِ، وَوَفِّقْني فيهِ لِتِلاوَةِ الْقُرْآنِ، يا مُنْزِلَ السَّكينَةِ فى قُلُوبِ الْمُؤْمِني"
            },
            20: {
                "dua_mm": "",
                "dua_en": "",
                "dua_ar": "اَللّـهُمَّ اجْعَلْ لى فيهِ اِلى مَرْضاتِكَ دَليلاً، وَلا تَجْعَلْ لِلشَّيْطانِ فيهِ عَلَيَّ سَبيلاً، وَاجْعَلِ الْجَنَّةَ لى مَنْزِلاً وَمَقيلاً، يا قاضِيَ حَوائِجِ الطّالِبي"
            },
            21: {
                "dua_mm": "",
                "dua_en": "",
                "dua_ar": "اَللّـهُمَّ افْتَحْ لى فيهِ أبواب فَضْلِكَ، وَاَنْزِلْ عَلَيَّ فيهِ بَرَكاتِكَ، وَوَفِّقْني فيهِ لِمُوجِباتِ مَرْضاتِكَ، وَاَسْكِنّي فيهِ بُحْبُوحاتِ جَنّاتِكَ، يا مُجيبَ دَعْوَةِ الْمُضْطَرّينَ"
            },
            22: {
                "dua_mm": "",
                "dua_en": "",
                "dua_ar": " اَللّـهُمَّ اغْسِلْني فيهِ مِنَ الذُّنُوبِ، وَطَهِّرْني فيهِ مِنَ الْعُيُوبِ، وَامْتَحِنْ قَلْبي فيهِ بِتَقْوَى الْقُلُوبِ، يا مُقيلَ عَثَراتِ الْمُذْنِبي"
            },
            23: {
                "dua_mm": "",
                "dua_en": "",
                "dua_ar": "  اَللّـهُمَّ إني أسألك فيهِ ما يُرْضيكَ، وأعوذ بِكَ مِمّا يُؤْذيكَ، وأسألك التَّوْفيقَ فيهِ لاِنْ أطيعك وَلا أعصيك، يا جَوادَ السّائِلينَ"
            },
            24: {
                "dua_mm": "",
                "dua_en": "",
                "dua_ar": " اَللّـهُمَّ اجْعَلْني فيهِ مُحِبَّاً لأوليائك، وَمُعادِياً لأعدائك، مُسْتَنّاً بِسُنَّةِ خاتَمِ أنبيائك، يا عاصِمَ قُلُوبِ النَّبِيّينَ"
            },
            25: {
                "dua_mm": "",
                "dua_en": "",
                "dua_ar": "اَللّـهُمَّ اجْعَلْ سَعْيي فيهِ مَشْكُوراً، وَذَنْبي فيهِ مَغْفُوراً وَعَمَلي فيهِ مَقْبُولاً، وَعَيْبي فيهِ مَسْتُوراً، يا اَسْمَعَ السّامِعينَ"
            },
            26: {
                "dua_mm": "",
                "dua_en": "",
                "dua_ar": "اَللّـهُمَّ ارْزُقْني فيهِ فَضْلَ لَيْلَةِ الْقَدْرِ، وَصَيِّرْ أموري فيهِ مِنَ الْعُسْرِ إلى الْيُسْرِ، وَاقْبَلْ مَعاذيري، وَحُطَّ عَنّيِ الذَّنْبَ وَالْوِزْرَ، يا رَؤوفاً بِعِبادِهِ الصّالِحي"
            },
            27: {
                "dua_mm": "",
                "dua_en": "",
                "dua_ar": "اَللّـهُمَّ وَفِّرْ حَظّي فيهِ مِنَ النَّوافِلِ، وأكرمني فيهِ بإحضار الْمَسائِلِ، وَقَرِّبْ فيهِ وسيلتي إليك مِنْ بَيْنِ الْوَسائِلِ، يا مَنْ لا يَشْغَلُهُ إلحاح الْمُلِحّينَ"
            },
            28: {
                "dua_mm": "",
                "dua_en": "",
                "dua_ar": "اَللّـهُمَّ غَشِّني فيهِ بِالرَّحْمَةِ ، وَارْزُقْني فيهِ التَّوْفيقَ وَالْعِصْمَةَ ، وَطَهِّرْ قَلْبي مِنْ غَياهِبِ التُّهْمَةِ ، يا رَحيماً بِعِبادِهِ الْمُؤْمِني"
            },
            29: {
                "dua_mm": "",
                "dua_en": "",
                "dua_ar": "اَللّـهُمَّ اجْعَلْ صِيامى فيهِ بِالشُّكْرِ وَالْقَبُولِ عَلى ما تَرْضاهُ وَيَرْضاهُ الرَّسُولُ، مُحْكَمَةً فُرُوعُهُ بِالاْصُولِ، بِحَقِّ سَيِّدِنا مُحَمَّد وَآلِهِ الطّاهِرينَ، وَالْحَمْدُ للهِ رَبِّ الْعالَمي"
            },
            30: {
                "dua_mm": "",
                "dua_en": "",
                "dua_ar": ""
            }
        }[x]


class TestGSheetFetch(unittest.TestCase):
    def test_api(self):
        scope = ['https://spreadsheets.google.com/feeds']
        credentials = ServiceAccountCredentials.from_json_keyfile_name('client-secret.json', scope)
        sh = gspread.authorize(credentials).open_by_key('1SjJG2RzITf8qAmYDU9RFnWVaMP9912y8KfbuJe8th-c')
        work_sheets = sh.worksheets()

        # assert len(work_sheets) == 14

        country_id = 'bef77a2d0e5c4061b6df0e8c6875837a'
        # 0-24
        # 25-50
        # 50-75
        # 75-100
        # 99-124
        # 124-149
        for ws_count, worksheet in enumerate(work_sheets[124:len(work_sheets)]):
            # TODO write State By Country Here
            state_name = worksheet.title
            print(state_name)
            state_id = str(uuid.uuid4().hex)
            state = State(id=state_id, object_id=state_id, country_id=str(country_id), name_mm_uni=str(state_name),
                          name_mm_zawgyi=Rabbit.uni2zg(state_name))
            cal_day_list = worksheet.col_values(1)
            hij_day_list = worksheet.col_values(2)
            sehri_time_list = worksheet.col_values(3)
            iftari_time_list = worksheet.col_values(4)

            db_session.add(state)
            db_session.commit()

            for i, (cal_day, hij_day, seh_time, iftar_time) in enumerate(
                    zip(cal_day_list, hij_day_list, sehri_time_list, iftari_time_list)):
                if i is not 0:
                    article_id = str(uuid.uuid4().hex)
                    article = Day(id=article_id, object_id=article_id,
                                  country_id=str(country_id),
                                  state_id=str(state.object_id),
                                  day=i, day_mm=str(MockConfig().get_mm_num(i)), sehri_time=str(seh_time) + " am",
                                  sehri_time_desc="Sehri",
                                  sehri_time_desc_mm_zawgyi=Rabbit.uni2zg("ဝါချည်ချိန်"),
                                  sehri_time_desc_mm_uni="ဝါချည်ချိန်",
                                  iftari_time=str(iftar_time) + " pm",
                                  dua_mm_uni=MockConfig().daily_dua(i)["dua_mm"],
                                  dua_mm_zawgyi=Rabbit.uni2zg(MockConfig().daily_dua(i)["dua_mm"]),
                                  dua_ar=MockConfig().daily_dua(i)["dua_ar"],
                                  dua_en=MockConfig().daily_dua(i)["dua_en"],
                                  iftari_time_desc="Iftari",
                                  iftari_time_desc_mm_zawgyi=Rabbit.uni2zg("ဝါဖြေချိန်"),
                                  iftari_time_desc_mm_uni="ဝါဖြေချိန်")
                    db_session.add(article)
                    db_session.commit()
