import os

from rabbit import Rabbit


def mm_num(x):
    return {
        0: '၀',
        1: '၁',
        2: '၂',
        3: '၃',
        4: '၄',
        5: '၅',
        6: '၆',
        7: '၇',
        8: '၈',
        9: '၉'

    }[x]


def get_state_name(x):
    return {'YANGON Region': "ရန်ကုန်တိုင်း",
            'NAY PYI DAW Region': "နေပြည်တော် (ပျဉ်းမနား)",
            'MANDALAY Region': "မန္တလေးတိုင်း",
            'KAYIN Region': "ကရင်ပြည်နယ်",
            'MON Region': "မွန်ပြည်နယ်",
            'KAYAR Region': "ကယားပြည်နယ်",
            'KACHIN Region': "ကချင်ပြည်နယ်",
            'SHAN Region': "ရှမ်းပြည်နယ်",
            'RAKHINE Region': "ရခိုင်ပြည်နယ်",
            'TANIN THARYE Region': "တင်္နသာရီတိုင်း",
            'MA GWAY Region': "မကွေးတိုင်း",
            'SAGAING Region': "စစ်ကိုင်းတိုင်း",
            'IRRWADY Region': "ဧရာဝတီတိုင်း",
            'BAGO Region': "ပဲခူးတိုင်း"

            }[x]


def daily_dua(x):
    return {
        1: dict(dua_mm="", dua_en="",
                dua_ar="اَللّـهُمَّ اجْعَلْ صِيامي فيهِ صِيامَ الصّائِمينَ، وَقِيامي فيهِ قيامَ الْقائِمينَ، وَنَبِّهْني فيهِ عَنْ نَوْمَةِ الْغافِلينَ، وَهَبْ لى جُرْمي فيهِ يا اِلـهَ الْعالَمينَ، وَاعْفُ عَنّي يا عافِياً عَنْ الْمجْرِمينَ ."),
        2: dict(dua_mm="", dua_en="",
                dua_ar="اَللّـهُمَّ قَرِّبْني فيهِ اِلى مَرْضاتِكَ، وَجَنِّبْني فيهِ مِنْ سَخَطِكَ وَنَقِماتِكَ، وَوَفِّقْني فيهِ لِقِرآءَةِ آياتك بِرَحْمَتِكَ يا اَرْحَمَ الرّاحِمينَ"),
        3: dict(dua_mm="", dua_en="",
                dua_ar="اَللّـهُمَّ ارْزُقْني فيهِ الذِّهْنَ وَالتَّنْبيهَ ، وَباعِدْني فيهِ مِنَ السَّفاهَةِ وَالَّتمْويهِ ، وَاجْعَلْ لى نَصيباً مِنْ كُلِّ خَيْر تُنْزِلُ فيهِ، بِجُودِكَ يا أجود الاْجْوَدينَ"),
        4: dict(dua_mm="", dua_en="",
                dua_ar="اَللّـهُمَّ قَوِّني فيهِ عَلى إقامة أمرك، وأذقني فيهِ حَلاوَةَ ذِكْرِكَ، وَاَوْزعْني فيهِ لاِداءِ شُكْرِكَ بِكَرَمِكَ، وَاحْفَظْني فيهِ بِحِفْظِكَ وَسَتْرِكَ، يا أبصر النّاظِرينَ"),
        5: dict(dua_mm="", dua_en="",
                dua_ar="اَللّـهُمَّ اجْعَلْني فيهِ مِنْ الْمُسْتَغْفِرينَ، وَاجْعَلْني فيهِ مِنْ عِبادِكَ الصّالِحينَ اْلقانِتينَ ، وَاجْعَلني فيهِ مِنْ اَوْلِيائِكَ الْمُقَرَّبينَ، بِرَأْفَتِكَ يا اَرْحَمَ الرّاحِمينَ"),
        6: {
            "dua_mm": "",
            "dua_en": "",
            "dua_ar": "اللّـهُمَّ لا تَخْذُلْني فيهِ لِتَعَرُّضِ مَعْصِيَتِكَ، وَلا تَضْرِبْني بِسِياطِ نَقِمَتِكَ، وَزَحْزِحْني فيهِ مِنْ مُوجِباتِ سَخَطِكَ ، بِمَنِّكَ وأياديك يا مُنْتَهى رَغْبَةِ الرّاغِبي"
        },
        7: {
            "dua_mm": "",
            "dua_en": "",
            "dua_ar": "اَللّـهُمَّ اَعِنّي فِيهِ عَلى صِيامِهِ وَقِيامِهِ، وَجَنِّبْني فيهِ مِنْ هَفَواتِهِ وَآثامِهِ، وَارْزُقْني فيهِ ذِكْرَكَ بِدَوامِهِ، بِتَوْفيقِكَ يا هادِيَ الْمُضِلّي"
        },
        8: {
            "dua_mm": "",
            "dua_en": "",
            "dua_ar": "اَللّـهُمَّ ارْزُقْني فيهِ رَحْمَةَ الأيتام، وإطعام اَلطَّعامِ، وإفشاء السَّلامِ، وَصُحْبَةَ الْكِرامِ، بِطَولِكَ يا ملجأ الآملين"
        },
        9: {
            "dua_mm": "",
            "dua_en": "",
            "dua_ar": "اللّـهُمَّ اجْعَلْ لي فيهِ نَصيباً مِنْ رَحْمَتِكَ الْواسِعَةِ، وَاهْدِني فيهِ لِبَراهينِكَ السّاطِعَةِ، وَخُذْ بِناصِيَتي اِلى مَرْضاتِكَ الْجامِعَةِ، بِمَحَبَّتِكَ يا أمل الْمُشْتاقي"
        },
        10: {
            "dua_mm": "",
            "dua_en": "",
            "dua_ar": " اَللّـهُمَّ اجْعَلْني فيهِ مِنَ الْمُتَوَكِّلينَ عَلَيْكَ، وَاجْعَلْني فيهِ مِنَ الْفائِزينَ لَدَيْكَ، وَاجْعَلْني فيهِ مِنَ الْمُقَرَّبينَ اِلَيْكَ، بإحسانك يا غايَةَ الطّالِبي"
        },
        11: {
            "dua_mm": "",
            "dua_en": "",
            "dua_ar": " اَللّـهُمَّ حَبِّبْ اِلَيَّ فيهِ الإحسان، وَكَرِّهْ اِلَيَّ فيهِ الْفُسُوقَ وَالْعِصْيانَ، وَحَرِّمْ عَلَيَّ فيهِ السَّخَطَ وَالنّيرانَ بِعَوْنِكَ يا غِياثَ الْمُسْتَغيثي"
        },
        12: {
            "dua_mm": "",
            "dua_en": "",
            "dua_ar": "اَللّـهُمَّ زَيِّنّي فيهِ بِالسِّتْرِ وَالْعَفافِ، وَاسْتُرْني فيهِ بِلِباسِ الْقُنُوعِ وَالْكَفافِ، وَاحْمِلْني فيهِ عَلَى الْعَدْلِ والإنصاف، وَآمِنّي فيهِ مِنْ كُلِّ ما أخاف، بِعِصْمَتِكَ يا عِصْمَةَ الْخائِفي"
        },
        13: {
            "dua_mm": "",
            "dua_en": "",
            "dua_ar": "اَللّـهُمَّ طَهِّرْني فيهِ مِنَ الدَّنَسِ والأقذار، وَصَبِّرْني فيهِ عَلى كائِناتِ الأقدار، وَوَفِّقْني فيهِ لِلتُّقى وَصُحْبَةِ الأبرار، بِعَوْنِكَ يا قُرَّةَ عَيْنِ الْمَساكينَ"
        },
        14: {
            "dua_mm": "",
            "dua_en": "",
            "dua_ar": "اَللّـهُمَّ لا تُؤاخِذْني فيهِ بِالْعَثَراتِ، وَاَقِلْني فيهِ مِنَ الْخَطايا وَالْهَفَواتِ ، وَلا تَجْعَلْني فيهِ غَرَضاً لِلْبَلايا والآفات، بِعِزَّتِكَ يا عِزَّ الْمُسْلِمي"
        },
        15: {
            "dua_mm": "",
            "dua_en": "",
            "dua_ar": "اَللّـهُمَّ ارْزُقْني فيهِ طاعَةَ الْخاشِعينَ، وَاشْرَحْ فيهِ صَدْري بإنابة الْمخْبِتينَ، بأمانك يا أمان الْخائِفينَ"
        },
        16: {
            "dua_mm": "",
            "dua_en": "",
            "dua_ar": "اَللّـهُمَّ وَفِّقْني فيهِ لِمُوافَقَةِ الأبرار، وَجَنِّبْني فيهِ مُرافَقَةَ الأشرار، وَآوِني فيهِ بِرَحْمَتِكَ اِلى دارِ الْقَـرارِ، بإلهيّتك يا اِلـهَ الْعالَمي"
        },
        17: {
            "dua_mm": "",
            "dua_en": "",
            "dua_ar": "اَللّـهُمَّ اهْدِني فيهِ لِصالِحِ الإعمال، وَاقْضِ لي فيهِ الْحَوائِجَ والآمال، يا مَنْ لا يَحْتاجُ اِلَى التَّفْسيرِ وَالسُّؤالِ، يا عالِماً بِما في صُدُورِ الْعالَمينَ، صَلِّ عَلى مُحَمَّد وَآلِهِ الطّاهِرينَ"
        },
        18: {
            "dua_mm": "",
            "dua_en": "",
            "dua_ar": "اَللّـهُمَّ نَبِّهْني فيهِ لِبَرَكاتِ أسحاره، وَنَوِّرْ فيهِ قَلْبي بِضياءِ أنواره، وَخُذْ بِكُلِّ أعضائي اِلَى إتباع آثارِهِ، بِنُورِكَ يا مُنَوِّرَ قُلُوبِ الْعارِفي"
        },
        19: {
            "dua_mm": "",
            "dua_en": "",
            "dua_ar": " اَللّـهُمَّ افْتَحْ لي فيهِ أبواب الْجِنانِ، وأغلق عَنّي فيهِ أبواب النّيرانِ، وَوَفِّقْني فيهِ لِتِلاوَةِ الْقُرْآنِ، يا مُنْزِلَ السَّكينَةِ فى قُلُوبِ الْمُؤْمِني"
        },
        20: {
            "dua_mm": "",
            "dua_en": "",
            "dua_ar": "اَللّـهُمَّ اجْعَلْ لى فيهِ اِلى مَرْضاتِكَ دَليلاً، وَلا تَجْعَلْ لِلشَّيْطانِ فيهِ عَلَيَّ سَبيلاً، وَاجْعَلِ الْجَنَّةَ لى مَنْزِلاً وَمَقيلاً، يا قاضِيَ حَوائِجِ الطّالِبي"
        },
        21: {
            "dua_mm": "",
            "dua_en": "",
            "dua_ar": "اَللّـهُمَّ افْتَحْ لى فيهِ أبواب فَضْلِكَ، وَاَنْزِلْ عَلَيَّ فيهِ بَرَكاتِكَ، وَوَفِّقْني فيهِ لِمُوجِباتِ مَرْضاتِكَ، وَاَسْكِنّي فيهِ بُحْبُوحاتِ جَنّاتِكَ، يا مُجيبَ دَعْوَةِ الْمُضْطَرّينَ"
        },
        22: {
            "dua_mm": "",
            "dua_en": "",
            "dua_ar": " اَللّـهُمَّ اغْسِلْني فيهِ مِنَ الذُّنُوبِ، وَطَهِّرْني فيهِ مِنَ الْعُيُوبِ، وَامْتَحِنْ قَلْبي فيهِ بِتَقْوَى الْقُلُوبِ، يا مُقيلَ عَثَراتِ الْمُذْنِبي"
        },
        23: {
            "dua_mm": "",
            "dua_en": "",
            "dua_ar": "  اَللّـهُمَّ إني أسألك فيهِ ما يُرْضيكَ، وأعوذ بِكَ مِمّا يُؤْذيكَ، وأسألك التَّوْفيقَ فيهِ لاِنْ أطيعك وَلا أعصيك، يا جَوادَ السّائِلينَ"
        },
        24: {
            "dua_mm": "",
            "dua_en": "",
            "dua_ar": " اَللّـهُمَّ اجْعَلْني فيهِ مُحِبَّاً لأوليائك، وَمُعادِياً لأعدائك، مُسْتَنّاً بِسُنَّةِ خاتَمِ أنبيائك، يا عاصِمَ قُلُوبِ النَّبِيّينَ"
        },
        25: {
            "dua_mm": "",
            "dua_en": "",
            "dua_ar": "اَللّـهُمَّ اجْعَلْ سَعْيي فيهِ مَشْكُوراً، وَذَنْبي فيهِ مَغْفُوراً وَعَمَلي فيهِ مَقْبُولاً، وَعَيْبي فيهِ مَسْتُوراً، يا اَسْمَعَ السّامِعينَ"
        },
        26: {
            "dua_mm": "",
            "dua_en": "",
            "dua_ar": "اَللّـهُمَّ ارْزُقْني فيهِ فَضْلَ لَيْلَةِ الْقَدْرِ، وَصَيِّرْ أموري فيهِ مِنَ الْعُسْرِ إلى الْيُسْرِ، وَاقْبَلْ مَعاذيري، وَحُطَّ عَنّيِ الذَّنْبَ وَالْوِزْرَ، يا رَؤوفاً بِعِبادِهِ الصّالِحي"
        },
        27: {
            "dua_mm": "",
            "dua_en": "",
            "dua_ar": "اَللّـهُمَّ وَفِّرْ حَظّي فيهِ مِنَ النَّوافِلِ، وأكرمني فيهِ بإحضار الْمَسائِلِ، وَقَرِّبْ فيهِ وسيلتي إليك مِنْ بَيْنِ الْوَسائِلِ، يا مَنْ لا يَشْغَلُهُ إلحاح الْمُلِحّينَ"
        },
        28: {
            "dua_mm": "",
            "dua_en": "",
            "dua_ar": "اَللّـهُمَّ غَشِّني فيهِ بِالرَّحْمَةِ ، وَارْزُقْني فيهِ التَّوْفيقَ وَالْعِصْمَةَ ، وَطَهِّرْ قَلْبي مِنْ غَياهِبِ التُّهْمَةِ ، يا رَحيماً بِعِبادِهِ الْمُؤْمِني"
        },
        29: {
            "dua_mm": "",
            "dua_en": "",
            "dua_ar": "اَللّـهُمَّ اجْعَلْ صِيامى فيهِ بِالشُّكْرِ وَالْقَبُولِ عَلى ما تَرْضاهُ وَيَرْضاهُ الرَّسُولُ، مُحْكَمَةً فُرُوعُهُ بِالاْصُولِ، بِحَقِّ سَيِّدِنا مُحَمَّد وَآلِهِ الطّاهِرينَ، وَالْحَمْدُ للهِ رَبِّ الْعالَمي"
        },
        30: {
            "dua_mm": "",
            "dua_en": "",
            "dua_ar": ""
        }
    }[x]


def get_mm_num(num):
    mm_digit = ""
    for c in range(len(str(num))):
        mm_digit += mm_num(int(str(num)[c]))
    return mm_digit


def gen_seeds():
    import uuid
    from database import db_session, Country, State, Day

    source_arr = [{
        "base_url": "http://androidweekly.net/issues/",
        "name": "Myanmar",
        "tag": "android"
    }]
    state_arr = ["ရန်ကုန်တိုင်း", "မန္တလေးတိုင်း", "ဧရာဝတီတိုင်း", "မကွေးတိုင်း", "စစ်ကိုင်းတိုင်း", "တင်္နသာရီတိုင်း",
                 "ပဲခူးတိုင်း", "ကချင်ပြည်နယ်", "ချင်းပြည်နယ်", "ရခိုင်ပြည်နယ်", "ရှမ်းပြည်နယ်", "ကယားပြည်နယ်",
                 "ကရင်ပြည်နယ်", "မွန်ပြည်နယ်"]
    for s in source_arr:
        print("Generating Country.......\n\n\n")
        country_id = str(uuid.uuid4().hex)

        country = Country(id=country_id, object_id=country_id, name=str(s["name"]))
        db_session.add(country)
        db_session.commit()
        if os.environ["ENV"] != 'production':
            for state in state_arr:
                print("Generating State........\n\n")
                issue_id = str(uuid.uuid4().hex)
                issue = State(id=issue_id, object_id=issue_id, country_id=str(country.object_id),
                              name_mm_uni=str(state),
                              name_mm_zawgyi=Rabbit.uni2zg(state))
                db_session.add(issue)
                db_session.commit()

                for art in range(1, 31):
                    print("Generating Days.......\n")
                    article_id = str(uuid.uuid4().hex)
                    article = Day(id=article_id, object_id=article_id,
                                  country_id=str(country.object_id),
                                  state_id=str(issue.object_id),
                                  day=art, day_mm=str(get_mm_num(art)), sehri_time="4:3" + str(art) + " am",
                                  sehri_time_desc="Sehri",
                                  sehri_time_desc_mm_zawgyi=Rabbit.uni2zg("ဝါချည်ချိန်"),
                                  sehri_time_desc_mm_uni="ဝါချည်ချိန်",
                                  iftari_time="7:3" + str(art) + " pm",
                                  dua_mm_uni=daily_dua(art)["dua_mm"],
                                  dua_mm_zawgyi=Rabbit.uni2zg(daily_dua(art)["dua_mm"]),
                                  dua_ar=daily_dua(art)["dua_ar"],
                                  dua_en=daily_dua(art)["dua_en"],
                                  iftari_time_desc="Iftari",
                                  iftari_time_desc_mm_zawgyi=Rabbit.uni2zg("ဝါဖြေချိန်"),
                                  iftari_time_desc_mm_uni="ဝါဖြေချိန်"
                                  )
                    db_session.add(article)
                    db_session.commit()
